
import sqlite3
import sql
conn = sqlite3.connect('site.db')
cur = conn.cursor()

questions = [
    ('Що значить цей знак?', 'images/1.png', 'Знак переходу', 'Автобусна зупинка', 'Парковка', 'Тупик'),
    ('Що значить цей знак?', 'images/2.png', 'Аварійно-небезпечна ділянка', 'Головна дорога', 'Вузький міст', 'Крутий підйом'),
    ('Що значить цей знак?', 'images/3.png', 'Знак стоп', 'Дати дорогу', 'Кінець обмеження', 'Об’їзд перешкоди'),
    ('Що значить цей знак?', 'images/4.png', 'В’їзд заборонено', 'Рух заборонено для вантажівок', 'Рух односторонній', 'Небезпечний поворот'),
    ('Що значить цей знак?', 'images/5.png', 'Обмеження швидкості', 'Зона для пішоходів', 'Круговий рух', 'Рух механічних ТЗ заборонено'),
    ('Що значить цей знак?', 'images/6.png', 'Рух заборонено', 'Рух прямо', 'Обгін дозволено', 'Зупинка заборонена'),
    ('Що значить цей знак?', 'images/7.png', 'Поступитися дорогою', 'Головна дорога', 'Кінець головної дороги', 'Рух заборонено'),
    ('Що значить цей знак?', 'images/8.png', 'Рух тільки прямо', 'Поворот ліворуч', 'Обгін дозволено', "В'їзд заборонено"),
    ('Що значить цей знак?', 'images/9.png', 'Кінець обмеження максимальної швидкості', 'Обмеження мінімальної швидкості', 'Кінець автомагістралі', 'В’їзд на автомагістраль'),
    ('Що значить цей знак?', 'images/10.png', 'Нерівна дорога', 'Ремонт дороги', 'Крутий спуск', 'Слизька дорога'),
    ('Що значить цей знак?', 'images/11.png', 'Діти', 'Пішохідний перехід', 'Школа', 'Місце зупинки транспорту'),
    ('Що значить цей знак?', 'images/12.png', 'Заборона зупинки', 'Заборона стоянки', 'Заборона обгону', 'Кінець зони стоянки'),
    ('Що значить цей знак?', 'images/13.png', 'Кінець населеного пункту', 'Кінець заборони обгону', 'Початок населеного пункту', 'Пішохідна зона'),
    ('Що значить цей знак?', 'images/14.png', 'Крутий підйом', 'Крутий спуск', 'Місце ДТП', 'Залізничний переїзд'),
    ('Що значить цей знак?', 'images/15.png', 'Небезпечний поворот праворуч', 'Поворот праворуч заборонено', 'Обгін дозволено', 'Виїзд на автомагістраль'),
    ('Що значить цей знак?', 'images/16.png', 'Круговий рух', 'Залізничний переїзд', 'Зупинка маршрутного транспорту', 'Нерівна дорога'),
    ('Що значить цей знак?', 'images/17.png', 'Залізничний переїзд без шлагбаума', 'Двосторонній рух', 'Рух велосипедів заборонено', 'Дорожні роботи'),
    ('Що значить цей знак?', 'images/18.png', 'Зона паркування', 'Зона дії знаку', 'Дозволена стоянка', 'Кінець зони паркування'),
    ('Що значить цей знак?', 'images/19.png', 'Рух заборонено для вантажних автомобілів', 'Стоянка вантажівок дозволена', 'В’їзд тільки для легкових авто', 'Рух дозволено лише автобусам'),
    ('Що значить цей знак?', 'images/20.png', 'Слизька дорога', 'Дорожні роботи', 'Пішохідна зона', 'Небезпечний поворот ліворуч')
]
for i in questions:
    cur.execute('''INSERT INTO questions(question_text, image_path, answer_1, answer_2, answer_3, answer_4) VALUES (?, ?, ?, ?, ?, ?)''', [i[0],i[1],i[2],i[3],i[4],i[5]])

conn.commit()
conn.close()


    